stressTest-proxy.yml
config:
  target: 'ec2-54-67-105-173.us-west-1.compute.amazonaws.com'
phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 10
scenarios:
  - name: 'most popular product'
    weight: 75
    flow:
    - loop:
      - get:
          url: '/levels/7777'
        count: 50
      - get:
          url: '/about/7777'
        count: 50
  - name: 'average product'
    weight: 15
    flow:
    - loop:
      - get:
          url: '/levels/6666'
        count: 50
      - get:
          url: '/about/6666'
        count: 50
  - name: 'unpopular product'
    weight: 10
    flow:
    - loop:
      - get:
          url: '/levels/3333'
        count: 50
      - get:
          url: '/about/3333'
        count: 50